# <a id ='7'>Read the following data set<a/>

In [ ]:
https://drive.google.com/file/d/1JGsnccuRtcXXxouEFrKYDSa7qDB724TU/view

# Rename the columns as per the columns of the link below

In [ ]:
'https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data'

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
from IPython.display import display
import sqlite3

# <a id='7'>Import the data<a/>

In [2]:
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data')
df.head()

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

# <a id='7'>Rename the columns<a/>

In [3]:
df.columns = ["age","workclass","fnlwgt","education","education_num","marital_status","occupation","relationship","race","sex","capital_gain","capital_loss","hours_per_week","native_country","income"]
df.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

# <a id='7'>Create a SQL Database from adult dataset and name it as SQLADB<a/>

In [4]:
import sqlalchemy
from sqlalchemy import create_engine

engine = create_engine('sqlite:///sqladb', echo=True)
df.to_sql('sqladb', engine, if_exists='replace')

2020-04-23 19:19:22,841 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2020-04-23 19:19:22,842 INFO sqlalchemy.engine.base.Engine ()
2020-04-23 19:19:22,845 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2020-04-23 19:19:22,846 INFO sqlalchemy.engine.base.Engine ()
2020-04-23 19:19:22,848 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("sqladb")
2020-04-23 19:19:22,850 INFO sqlalchemy.engine.base.Engine ()
2020-04-23 19:19:22,852 INFO sqlalchemy.engine.base.Engine PRAGMA temp.table_info("sqladb")
2020-04-23 19:19:22,859 INFO sqlalchemy.engine.base.Engine ()
2020-04-23 19:19:22,873 INFO sqlalchemy.engine.base.Engine
CREATE TABLE sqladb (
	"index" BIGINT,
	age BIGINT,
	workclass TEXT,
	fnlwgt BIGINT,
	education TEXT,
	education_num BIGINT,
	marital_status TEXT,
	occupation TEXT,
	relationship TEXT,
	race TEXT,
	sex TEXT,
	capital_gain BIGINT,
	capital_loss BIGINT,
	hours_per_week BIGINT,
	native_country TEXT,
	income TEXT
)


2020-04-23 19:19:22,878 INFO sqlalchemy.engine.base.Engine ()
2020-04-23 19:19:22,889 INFO sqlalchemy.engine.base.Engine COMMIT
2020-04-23 19:19:22,898 INFO sqlalchemy.engine.base.Engine CREATE INDEX ix_sqladb_index ON sqladb ("index")
2020-04-23 19:19:22,899 INFO sqlalchemy.engine.base.Engine ()
2020-04-23 19:19:22,904 INFO sqlalchemy.engine.base.Engine COMMIT
2020-04-23 19:19:22,942 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-04-23 19:19:23,426 INFO sqlalchemy.engine.base.Engine INSERT INTO sqladb ("index", age, workclass, fnlwgt, education, education_num, marital_status, occupation, relationship, race, sex, capital_gain, capital_loss, hours_per_week, native_country, income) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2020-04-23 19:19:23,427 INFO sqlalchemy.engine.base.Engine ((0, 50, ' Self-emp-not-inc', 83311, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K'), (1, 38, ' Private', 215646, ' HS-grad', 9, ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (2, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (3, 28, ' Private', 338409, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Wife', ' Black', ' Female', 0, 0, 40, ' Cuba', ' <=50K'), (4, 37, ' Private', 284582, ' Masters', 14, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 0, 0, 40, ' United-States', ' <=50K'), (5, 49, ' Private', 160187, ' 9th', 5, ' Married-spouse-absent', ' Other-service', ' Not-in-family', ' Black', ' Female', 0, 0, 16, ' Jamaica', ' <=50K'), (6, 52, ' Self-emp-not-inc', 209642, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 45, ' United-States', ' >50K'), (7, 31, ' Private', 45781, ' Masters', 14, ' Never-married', ' Prof-specialty', ' Not-in-family', ' White', ' Female', 14084, 0, 50, ' United-States', ' >50K')  ... displaying 10 of 32560 total bound parameter sets ...  (32558, 22, ' Private', 201490, ' HS-grad', 9, ' Never-married', ' Adm-clerical', ' Own-child', ' White', ' Male', 0, 0, 20, ' United-States', ' <=50K'), (32559, 52, ' Self-emp-inc', 287927, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 15024, 0, 40, ' United-States', ' >50K'))
2020-04-23 19:19:23,672 INFO sqlalchemy.engine.base.Engine COMMIT

In [ ]:
# <a id='7'>Rename the columns<a/>

In [ ]:
# <a id='7'>Rename the columns<a/>

In [ ]:
# <a id='7'>Rename the columns<a/>

In [ ]:
# <a id='7'>Rename the columns<a/>

In [ ]:
# <a id='7'>Rename the columns<a/>

In [ ]:
# <a id='7'>Rename the columns<a/>

In [ ]:
# <a id='7'>Rename the columns<a/>

In [ ]:
# <a id='7'>Rename the columns<a/>

In [ ]:
# <a id='7'>Rename the columns<a/>

In [ ]:
# <a id='7'>Rename the columns<a/>

In [ ]:
# <a id='7'>Rename the columns<a/>

In [ ]:
# <a id='7'>Rename the columns<a/>

In [ ]:
# <a id='7'>Rename the columns<a/>